// modules are defined as an array
// [ module function, map of requires ]
//
// map of requires is short require name -> numeric require
//
// anything defined in a previous bundle is accessed via the
// orig method which is the require for previous bundles
parcelRequire = (function (modules, cache, entry, globalName) {
  // Save the require from previous bundle to this closure if any
  var previousRequire = typeof parcelRequire === 'function' && parcelRequire;
  var nodeRequire = typeof require === 'function' && require;

  function newRequire(name, jumped) {
    if (!cache[name]) {
      if (!modules[name]) {
        // if we cannot find the module within our internal map or
        // cache jump to the current global require ie. the last bundle
        // that was added to the page.
        var currentRequire = typeof parcelRequire === 'function' && parcelRequire;
        if (!jumped && currentRequire) {
          return currentRequire(name, true);
        }

        // If there are other bundles on this page the require from the
        // previous one is saved to 'previousRequire'. Repeat this as
        // many times as there are bundles until the module is found or
        // we exhaust the require chain.
        if (previousRequire) {
          return previousRequire(name, true);
        }

        // Try the node require function if it exists.
        if (nodeRequire && typeof name === 'string') {
          return nodeRequire(name);
        }

        var err = new Error('Cannot find module \'' + name + '\'');
        err.code = 'MODULE_NOT_FOUND';
        throw err;
      }

      localRequire.resolve = resolve;
      localRequire.cache = {};

      var module = cache[name] = new newRequire.Module(name);

      modules[name][0].call(module.exports, localRequire, module, module.exports, this);
    }

    return cache[name].exports;

    function localRequire(x){
      return newRequire(localRequire.resolve(x));
    }

    function resolve(x){
      return modules[name][1][x] || x;
    }
  }

  function Module(moduleName) {
    this.id = moduleName;
    this.bundle = newRequire;
    this.exports = {};
  }

  newRequire.isParcelRequire = true;
  newRequire.Module = Module;
  newRequire.modules = modules;
  newRequire.cache = cache;
  newRequire.parent = previousRequire;
  newRequire.register = function (id, exports) {
    modules[id] = [function (require, module) {
      module.exports = exports;
    }, {}];
  };

  var error;
  for (var i = 0; i < entry.length; i++) {
    try {
      newRequire(entry[i]);
    } catch (e) {
      // Save first error but execute all entries
      if (!error) {
        error = e;
      }
    }
  }

  if (entry.length) {
    // Expose entry point to Node, AMD or browser globals
    // Based on https://github.com/ForbesLindesay/umd/blob/master/template.js
    var mainExports = newRequire(entry[entry.length - 1]);

    // CommonJS
    if (typeof exports === "object" && typeof module !== "undefined") {
      module.exports = mainExports;

    // RequireJS
    } else if (typeof define === "function" && define.amd) {
     define(function () {
       return mainExports;
     });

    // <script>
    } else if (globalName) {
      this[globalName] = mainExports;
    }
  }

  // Override the current require with this new one
  parcelRequire = newRequire;

  if (error) {
    // throw error from earlier, _after updating parcelRequire_
    throw error;
  }

  return newRequire;
})({"script.js":[function(require,module,exports) {
var btn1 = document.querySelector(".button1");
var selects = document.querySelectorAll('.__select');
var inputs = document.querySelectorAll('.__input');
function choise() {
  var p1 = document.getElementById("brand").value;
  var p2 = document.getElementById("typeOpen").value;
  var p3 = document.getElementById("color").value;
  var p4 = document.getElementById("fb").value;
  var p5 = document.getElementById("fh").value;
  var p6 = document.getElementById("side").value;
  document.getElementById("alarm").hidden = true;
  switch (p1) {
    case "Roto Al":
      fill2("-", "-", "-", "-", "-", "-");
      switch (p2) {
        case "Поворотно-откидное":
          document.getElementById("comm").hidden = false;
          document.getElementById("prim").hidden = false;
          document.getElementById("comm").innerHTML = "При весе створки более 90 кг необходимо добавить на каждую створку крепежную кулису 728695 и втулку с винтом 793407";
          switch (p3) {
            case "Белый":
              if (p4 < 405) {
                fill("Минимальная ширина - 405мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
              } else {
                if (p4 < 600) {
                  console.log('RotoAl п/о белый  ширина 405-600мм ');
                  if (p5 < 520) {
                    fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p5 < 1300) {
                      fill("Запорные элементы", 728804, 1, "Ножницы 400", 728785, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728795, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1800) {
                        fill("Запорные элементы", 728804, 1, "Ножницы 400", 728785, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728795, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 2400) {
                          fill("Запорные элементы", 728804, 1, "Ножницы 400", 728785, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728795, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 2700) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 400", 728785, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728795, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "Ответная планка V01", 728918, 4, "Запорная цапфа", 334671, 4, "Резьбовая втулка", 212654, 1, "Винт для резьбовой втулки", 728935, 1, "-", "-", "-");
                          } else {
                            fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          }
                        }
                      }
                    }
                  }
                } else {
                  if (p4 < 1000) {
                    console.log('RotoAl п/о белый  ширина 600-1000мм ');
                    if (p5 < 520) {
                      fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1300) {
                        fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728795, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1800) {
                          fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728795, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 2400) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728795, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 2700) {
                              fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728795, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 5, "Запорная цапфа", 334671, 5, "Переключатель MV комп", 728842, 1, "Резьбовая втулка", 212654, 1, "Винт для резьбовой втулки", 728935, 1, "-", "-", "-", "-", "-", "-");
                            } else {
                              fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            }
                          }
                        }
                      }
                    }
                  } else {
                    if (p4 < 1300) {
                      console.log('RotoAl п/о белый  ширина 1000-1300мм ');
                      if (p5 < 520) {
                        fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728795, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1800) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728795, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 2400) {
                              fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728795, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Переключатель MV комп", 728842, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 2700) {
                                fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728795, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 4, "Запорная цапфа", 334671, 4, "Переключатель MV комп", 728842, 2, "Резьбовая втулка", 212654, 1, "Винт для резьбовой втулки", 728935, 1, "-", "-", "-", "-", "-", "-");
                              } else {
                                fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    } else {
                      if (p4 < 1600) {
                        console.log('RotoAl п/о белый  ширина 1300-1600мм');
                        if (p5 < 520) {
                          fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728795, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "Дополнительные ножницы ", 728806, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1800) {
                              fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728795, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Переключатель MV комп", 728842, 2, "Дополнительные ножницы ", 728806, 1, "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 2400) {
                                fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728795, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Переключатель MV комп", 728842, 2, "Дополнительные ножницы ", 728806, 1, "-", "-", "-", "-", "-", "-");
                              } else {
                                if (p5 < 2700) {
                                  fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728795, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 4, "Запорная цапфа", 334671, 4, "Переключатель MV комп", 728842, 2, "Дополнительные ножницы ", 728806, 1, "Резьбовая втулка", 212654, 1, "Винт для резьбовой втулки", 728935, 1);
                                } else {
                                  fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        }
                      } else {
                        fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      }
                    }
                  }
                }
              }
              break;
            case "Неокрас":
              if (p4 < 405) {
                fill("Минимальная ширина - 405мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
              } else {
                if (p4 < 600) {
                  console.log('RotoAl п/о Неокрас ширина 405-600мм ');
                  if (p5 < 520) {
                    fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p5 < 1300) {
                      fill("Запорные элементы", 728804, 1, "Ножницы 400", 728785, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 770390, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1800) {
                        fill("Запорные элементы", 728804, 1, "Ножницы 400", 728785, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 770390, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 2400) {
                          fill("Запорные элементы", 728804, 1, "Ножницы 400", 728785, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 728390, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 2700) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 400", 728785, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 728390, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "Ответная планка V01", 728918, 4, "Запорная цапфа", 334671, 4, "Резьбовая втулка", 212654, 1, "Винт для резьбовой втулки", 728935, 1, "-", "-", "-");
                          } else {
                            fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          }
                        }
                      }
                    }
                  }
                } else {
                  if (p4 < 1000) {
                    console.log('RotoAl п/о Неокрас ширина 600-1000мм ');
                    if (p5 < 520) {
                      fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1300) {
                        fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 728390, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1800) {
                          fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 728390, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 2400) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 728390, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 2700) {
                              fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 728390, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 5, "Запорная цапфа", 334671, 5, "Переключатель MV комп", 728842, 1, "Резьбовая втулка", 212654, 1, "Винт для резьбовой втулки", 728935, 1, "-", "-", "-", "-", "-", "-");
                            } else {
                              fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            }
                          }
                        }
                      }
                    }
                  } else {
                    if (p4 < 1300) {
                      console.log('RotoAl п/о Неокрас ширина 1000-1300мм ');
                      if (p5 < 520) {
                        fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 770390, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1800) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 770390, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 2400) {
                              fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 728390, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Переключатель MV комп", 728842, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 2700) {
                                fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 728390, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 4, "Запорная цапфа", 334671, 4, "Переключатель MV комп", 728842, 2, "Резьбовая втулка", 212654, 1, "Винт для резьбовой втулки", 728935, 1, "-", "-", "-", "-", "-", "-");
                              } else {
                                fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    } else {
                      if (p4 < 1600) {
                        console.log('RotoAl п/о Неокрас ширина 1300-1600мм');
                        if (p5 < 520) {
                          fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 770390, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "Дополнительные ножницы ", 728806, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1800) {
                              fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 728390, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Переключатель MV комп", 728842, 2, "Дополнительные ножницы ", 728806, 1, "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 2400) {
                                fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 728390, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Переключатель MV комп", 728842, 2, "Дополнительные ножницы ", 728806, 1, "-", "-", "-", "-", "-", "-");
                              } else {
                                if (p5 < 2700) {
                                  fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 728390, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Переключатель MV комп", 728842, 2, "Дополнительные ножницы ", 728806, 1, "Резьбовая втулка", 212654, 1, "Винт для резьбовой втулки", 728935, 1);
                                } else {
                                  fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        }
                      } else {
                        fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      }
                    }
                  }
                }
              }
              break;
            case "Серый":
              if (p4 < 405) {
                fill("Минимальная ширина - 405мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
              } else {
                if (p4 < 600) {
                  console.log('RotoAl п/о Серый ширина 405-600мм ');
                  if (p5 < 520) {
                    fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p5 < 1300) {
                      fill("Запорные элементы", 728804, 1, "Ножницы 400", 728785, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 728792, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1800) {
                        fill("Запорные элементы", 728804, 1, "Ножницы 400", 728785, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 728792, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 2400) {
                          fill("Запорные элементы", 728804, 1, "Ножницы 400", 728785, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 728792, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 2700) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 400", 728785, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 728792, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "Ответная планка V01", 728918, 4, "Запорная цапфа", 334671, 4, "Резьбовая втулка", 212654, 1, "Винт для резьбовой втулки", 728935, 1, "-", "-", "-");
                          } else {
                            fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          }
                        }
                      }
                    }
                  }
                } else {
                  if (p4 < 1000) {
                    console.log('RotoAl п/о Серый ширина 600-1000мм ');
                    if (p5 < 520) {
                      fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1300) {
                        fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 728792, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1800) {
                          fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 728792, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 2400) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 728792, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 2700) {
                              fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 728792, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 5, "Запорная цапфа", 334671, 5, "Переключатель MV комп", 728842, 1, "Резьбовая втулка", 212654, 1, "Винт для резьбовой втулки", 728935, 1, "-", "-", "-", "-", "-", "-");
                            } else {
                              fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            }
                          }
                        }
                      }
                    }
                  } else {
                    if (p4 < 1300) {
                      console.log('RotoAl п/о Серый ширина 1000-1300мм ');
                      if (p5 < 520) {
                        fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 728792, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1800) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 728792, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 2400) {
                              fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 728792, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Переключатель MV комп", 728842, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 2700) {
                                fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 728792, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 4, "Запорная цапфа", 334671, 4, "Переключатель MV комп", 728842, 2, "Резьбовая втулка", 212654, 1, "Винт для резьбовой втулки", 728935, 1, "-", "-", "-", "-", "-", "-");
                              } else {
                                fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    } else {
                      if (p4 < 1600) {
                        console.log('RotoAl п/о Серый ширина 1300-1600мм');
                        if (p5 < 520) {
                          fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 728792, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "Дополнительные ножницы ", 728806, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1800) {
                              fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 728792, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Переключатель MV комп", 728842, 2, "Дополнительные ножницы ", 728806, 1, "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 2400) {
                                fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 728792, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Переключатель MV комп", 728842, 2, "Дополнительные ножницы ", 728806, 1, "-", "-", "-", "-", "-", "-");
                              } else {
                                if (p5 < 2700) {
                                  fill("Запорные элементы", 728804, 1, "Ножницы 600", 728786, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 728792, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Переключатель MV комп", 728842, 2, "Дополнительные ножницы ", 728806, 1, "Резьбовая втулка", 212654, 1, "Винт для резьбовой втулки", 728935, 1);
                                } else {
                                  fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        }
                      } else {
                        fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      }
                    }
                  }
                }
              }
              break;
            default:
              console.log('RotoAl Поворотно-откидное Какой цвет ???');
          }
          break;
        case "Поворотное":
          document.getElementById("comm").hidden = false;
          document.getElementById("prim").hidden = false;
          document.getElementById("comm").innerHTML = "При весе створки более 90 кг необходимо добавить на каждую створку крепежную кулису 728695 и втулку с винтом 793407";
          switch (p3) {
            case "Белый":
              if (p4 < 405) {
                fill("Минимальная ширина - 405мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
              } else {
                if (p4 < 1300) {
                  console.log('RotoAl п/о белый  ширина 405-1300мм ');
                  if (p5 < 520) {
                    fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p5 < 1200) {
                      fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728740, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1800) {
                        fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728740, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1, "Средний прижим на створке", 728884, 1, "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 2400) {
                          fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728740, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2, "Средний прижим на створке", 728884, 2, "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 2700) {
                            fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728740, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3, "Средний прижим на створке", 728884, 3, "-", "-", "-", "-", "-", "-");
                          } else {
                            fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          }
                        }
                      }
                    }
                  }
                } else {
                  if (p4 < 1600) {
                    console.log('RotoAl п/о белый  ширина 1300-1600мм');
                    if (p5 < 520) {
                      fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1200) {
                        fill("Запорные элементы", 728743, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728740, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1800) {
                          fill("Запорные элементы", 728743, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728740, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1, "Средний прижим на створке", 728884, 1, "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 2400) {
                            fill("Запорные элементы", 728743, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728740, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2, "Средний прижим на створке", 728884, 2, "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 2700) {
                              fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE белая", 377477, 1, "Комплект белых петель", 728740, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3, "Средний прижим на створке", 728884, 3, "-", "-", "-", "-", "-", "-");
                            } else {
                              fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            }
                          }
                        }
                      }
                    }
                  } else {
                    fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  }
                }
              }
              break;
            case "Неокрас":
              if (p4 < 405) {
                fill("Минимальная ширина - 405мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
              } else {
                if (p4 < 1300) {
                  console.log('RotoAl п/о Неокрас ширина 405-1300мм ');
                  if (p5 < 520) {
                    fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p5 < 1200) {
                      fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 770356, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1800) {
                        fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 770356, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1, "Средний прижим на створке", 728884, 1, "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 2400) {
                          fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 770356, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2, "Средний прижим на створке", 728884, 2, "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 2700) {
                            fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 770356, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3, "Средний прижим на створке", 728884, 3, "-", "-", "-", "-", "-", "-");
                          } else {
                            fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          }
                        }
                      }
                    }
                  }
                } else {
                  if (p4 < 1600) {
                    console.log('RotoAl п/о Неокрас ширина 1300-1600мм');
                    if (p5 < 520) {
                      fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1200) {
                        fill("Запорные элементы", 728743, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 770356, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1800) {
                          fill("Запорные элементы", 728743, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 770356, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1, "Средний прижим на створке", 728884, 1, "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 2400) {
                            fill("Запорные элементы", 728743, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 770356, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2, "Средний прижим на створке", 728884, 2, "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 2700) {
                              fill("Запорные элементы", 728743, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Комплект петель неокрас", 770356, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3, "Средний прижим на створке", 728884, 3, "-", "-", "-", "-", "-", "-");
                            } else {
                              fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            }
                          }
                        }
                      }
                    }
                  } else {
                    fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  }
                }
              }
              break;
            case "Серый":
              if (p4 < 405) {
                fill("Минимальная ширина - 405мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
              } else {
                if (p4 < 1300) {
                  console.log('RotoAl п/о Серый ширина 405-1300мм ');
                  if (p5 < 520) {
                    fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p5 < 1200) {
                      fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1800) {
                        fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1, "Средний прижим на створке", 728884, 1, "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 2400) {
                          fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2, "Средний прижим на створке", 728884, 2, "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 2700) {
                            fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3, "Средний прижим на створке", 728884, 3, "-", "-", "-", "-", "-", "-");
                          } else {
                            fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          }
                        }
                      }
                    }
                  }
                } else {
                  if (p4 < 1600) {
                    console.log('RotoAl п/о Серый ширина 1300-1600мм');
                    if (p5 < 520) {
                      fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1200) {
                        fill("Запорные элементы", 728743, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1800) {
                          fill("Запорные элементы", 728743, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1, "Средний прижим на створке", 728884, 1, "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 2400) {
                            fill("Запорные элементы", 728743, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2, "Средний прижим на створке", 728884, 2, "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 2700) {
                              fill("Запорные элементы", 728743, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE серая", 377474, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3, "Средний прижим на створке", 728884, 3, "-", "-", "-", "-", "-", "-");
                            } else {
                              fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            }
                          }
                        }
                      }
                    }
                  } else {
                    fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  }
                }
              }
              break;
            default:
              console.log('RotoAl Поворотно-откидное Какой цвет ???');
          }
          break;
        case "Фрамужное":
          document.getElementById("comm").hidden = false;
          document.getElementById("prim").hidden = false;
          switch (p3) {
            case "Белый":
              document.getElementById("comm").innerHTML = "При весе створки более 70 кг необходимо заменить петли 815704 на 1 комплект петель 728719";
              if (p4 < 520) {
                fill("Минимальная ширина - 520мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
              } else {
                if (p4 < 1100) {
                  console.log('RotoAl фрам белый  ширина 520-1100мм ');
                  if (p5 < 405) {
                    fill("Минимальная высота - 405мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p5 < 1300) {
                      fill("Запорная цапфа", 334671, 2, "Ответная планка", 728918, 2, "Ручка ROTOLINE белая", 377477, 1, "Белые фрамужные петли до 70кг", 815704, 2, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Подпятник", 212008, 1, "Фрамужные ножницы", 728862, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    }
                  }
                } else {
                  if (p4 < 1600) {
                    console.log('RotoAl фрам белый  ширина 1100-1600мм');
                    if (p5 < 405) {
                      fill("Минимальная высота - 405мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1300) {
                        fill("Запорная цапфа", 334671, 3, "Ответная планка", 728918, 3, "Ручка ROTOLINE белая", 377477, 1, "Белые фрамужные петли до 70кг", 815704, 3, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Подпятник", 212008, 1, "Фрамужные ножницы", 728862, 2, "Средний прижим на раме", 728885, 1, "Средний прижим на створке", 728884, 1, "-", "-", "-", "-", "-", "-");
                      } else {
                        fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      }
                    }
                  } else {
                    fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  }
                }
              }
              break;
            case "Неокрас":
              document.getElementById("comm").innerHTML = "При весе створки более 70 кг необходимо заменить петли 815700 на 1 комплект петель 770372";
              if (p4 < 520) {
                fill("Минимальная ширина - 520мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
              } else {
                if (p4 < 1100) {
                  console.log('RotoAl фрам неокрасширина 520-1100мм ');
                  if (p5 < 405) {
                    fill("Минимальная высота - 405мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p5 < 1300) {
                      fill("Запорная цапфа", 334671, 2, "Ответная планка", 728918, 2, "Ручка ROTOLINE неокрас", 238680, 1, "Фрамужные петли неокрас до 70кг", 815700, 2, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Подпятник", 212008, 1, "Фрамужные ножницы", 728862, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    }
                  }
                } else {
                  if (p4 < 1600) {
                    console.log('RotoAl фрам белый  ширина 1100-1600мм');
                    if (p5 < 405) {
                      fill("Минимальная высота - 405мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1300) {
                        fill("Запорная цапфа", 334671, 3, "Ответная планка", 728918, 3, "Ручка ROTOLINE неокрас", 238680, 1, "Фрамужные петли неокрас до 70кг", 815700, 2, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Подпятник", 212008, 1, "Фрамужные ножницы", 728862, 2, "Средний прижим на раме", 728885, 1, "Средний прижим на створке", 728884, 1, "-", "-", "-", "-", "-", "-");
                      } else {
                        fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      }
                    }
                  } else {
                    fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  }
                }
              }
              break;
            case "Серый":
              document.getElementById("comm").innerHTML = "При весе створки более 70 кг необходимо заменить петли 815706 на 1 комплект петель 728716";
              if (p4 < 520) {
                fill("Минимальная ширина - 520мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
              } else {
                if (p4 < 1100) {
                  console.log('RotoAl фрам серый ширина 520-1100мм ');
                  if (p5 < 405) {
                    fill("Минимальная высота - 405мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p5 < 1300) {
                      fill("Запорная цапфа", 334671, 2, "Ответная планка", 728918, 2, "Ручка ROTOLINE серая", 377474, 1, "Серые фрамужные петли до 70кг", 815706, 2, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Подпятник", 212008, 1, "Фрамужные ножницы", 728862, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    }
                  }
                } else {
                  if (p4 < 1600) {
                    console.log('RotoAl фрам белый  ширина 1100-1600мм');
                    if (p5 < 405) {
                      fill("Минимальная высота - 405мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1300) {
                        fill("Запорная цапфа", 334671, 3, "Ответная планка", 728918, 3, "Ручка ROTOLINE серая", 377474, 1, "Серые фрамужные петли до 70кг", 815706, 3, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Подпятник", 212008, 1, "Фрамужные ножницы", 728862, 2, "Средний прижим на раме", 728885, 1, "Средний прижим на створке", 728884, 1, "-", "-", "-", "-", "-", "-");
                      } else {
                        fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      }
                    }
                  } else {
                    fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  }
                }
              }
              break;
            default:
              console.log('RotoAl Фрамужное Какой цвет ???');
          }
          break;
        default:
          console.log('RotoAl Какое открывание ??? Какой цвет ???');
      }
      break;
    case "Roto T300":
      fill2("-", "-", "-", "-", "-", "-");
      switch (p2) {
        case "Поворотно-откидное":
          document.getElementById("comm").hidden = false;
          document.getElementById("prim").hidden = false;
          switch (p3) {
            case "Белый":
              document.getElementById("comm").innerHTML = "Для замены на ось 10мм необходимо заменить петли 488299 на 486499 ";
              if (p4 < 390) {
                fill("Минимальная ширина - 390мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
              } else {
                if (p4 < 700) {
                  console.log('Roto300 п/о белый  ширина 390-700мм ');
                  if (p5 < 580) {
                    fill("Минимальная высота - 580мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p5 < 1200) {
                      fill("Запорные элементы", 728804, 1, "Ножницы 400", 490172, 1, "Ручка ROTOLINE белая", 486163, 1, "Комплект белых петель", 488299, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1800) {
                        fill("Запорные элементы", 728804, 1, "Ножницы 400", 490172, 1, "Ручка ROTOLINE белая", 486163, 1, "Комплект белых петель", 488299, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 2400) {
                          fill("Запорные элементы", 728804, 1, "Ножницы 400", 490172, 1, "Ручка ROTOLINE белая", 486163, 1, "Комплект белых петель", 488299, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          fill("Максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        }
                      }
                    }
                  }
                } else {
                  if (p4 < 1000) {
                    console.log('Roto300 п/о белый  ширина 700-1000мм ');
                    if (p5 < 580) {
                      fill("Минимальная высота - 580мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1200) {
                        fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE белая", 486163, 1, "Комплект белых петель", 488299, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1800) {
                          fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE белая", 486163, 1, "Комплект белых петель", 488299, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 2400) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE белая", 486163, 1, "Комплект белых петель", 488299, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            fill("Максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          }
                        }
                      }
                    }
                  } else {
                    if (p4 < 1300) {
                      console.log('Roto300 п/о белый  ширина 1000-1300мм ');
                      if (p5 < 580) {
                        fill("Минимальная высота - 580мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1200) {
                          fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE белая", 486163, 1, "Комплект белых петель", 488299, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1800) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE белая", 486163, 1, "Комплект белых петель", 488299, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 2400) {
                              fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE белая", 486163, 1, "Комплект белых петель", 488299, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 2, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            } else {
                              fill("Максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            }
                          }
                        }
                      }
                    } else {
                      if (p4 < 1600) {
                        console.log('Roto300 п/о белый  ширина 1300-1600мм');
                        if (p5 < 580) {
                          fill("Минимальная высота - 580мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1200) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE белая", 486163, 1, "Комплект белых петель", 488299, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "Дополнительные ножницы", 728806, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1800) {
                              fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE белая", 486163, 1, "Комплект белых петель", 488299, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 2, "Дополнительные ножницы", 728806, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 2400) {
                                fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE белая", 486163, 1, "Комплект белых петель", 488299, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 2, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Дополнительные ножницы", 728806, 1, "-", "-", "-", "-", "-", "-");
                              } else {
                                fill("Максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      } else {
                        fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      }
                    }
                  }
                }
              }
              break;
            case "Неокрас":
              document.getElementById("comm").innerHTML = "Для замены на ось 10мм необходимо заменить петли 488300 на 486500 ";
              if (p4 < 390) {
                fill("Минимальная ширина - 390мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
              } else {
                if (p4 < 700) {
                  console.log('Roto300 п/о белый  ширина 390-700мм ');
                  if (p5 < 580) {
                    fill("Минимальная высота - 580мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p5 < 1200) {
                      fill("Запорные элементы", 728804, 1, "Ножницы 400", 490172, 1, "Ручка ROTOLINE неокрас", 486165, 1, "Комплект неокрашенных петель", 488300, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1800) {
                        fill("Запорные элементы", 728804, 1, "Ножницы 400", 490172, 1, "Ручка ROTOLINE неокрас", 486165, 1, "Комплект неокрашенных петель", 488300, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 2400) {
                          fill("Запорные элементы", 728804, 1, "Ножницы 400", 490172, 1, "Ручка ROTOLINE неокрас", 486165, 1, "Комплект неокрашенных петель", 488300, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          fill("Максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        }
                      }
                    }
                  }
                } else {
                  if (p4 < 1000) {
                    console.log('Roto300 п/о белый  ширина 700-1000мм ');
                    if (p5 < 580) {
                      fill("Минимальная высота - 580мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1200) {
                        fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE неокрас", 486165, 1, "Комплект неокрашенных петель", 488300, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1800) {
                          fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE неокрас", 486165, 1, "Комплект неокрашенных петель", 488300, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 2400) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE неокрас", 486165, 1, "Комплект неокрашенных петель", 488300, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            fill("Максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          }
                        }
                      }
                    }
                  } else {
                    if (p4 < 1300) {
                      console.log('Roto300 п/о белый  ширина 1000-1300мм ');
                      if (p5 < 580) {
                        fill("Минимальная высота - 580мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1200) {
                          fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE неокрас", 486165, 1, "Комплект неокрашенных петель", 488300, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1800) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE неокрас", 486165, 1, "Комплект неокрашенных петель", 488300, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 2400) {
                              fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE неокрас", 486165, 1, "Комплект неокрашенных петель", 488300, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 2, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            } else {
                              fill("Максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            }
                          }
                        }
                      }
                    } else {
                      if (p4 < 1600) {
                        console.log('Roto300 п/о белый  ширина 1300-1600мм');
                        if (p5 < 580) {
                          fill("Минимальная высота - 580мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1200) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE неокрас", 486163, 1, "Комплект неокрашенных петель", 488300, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "Дополнительные ножницы", 728806, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1800) {
                              fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE неокрас", 486163, 1, "Комплект неокрашенных петель", 488300, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 2, "Дополнительные ножницы", 728806, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 2400) {
                                fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE неокрас", 486163, 1, "Комплект неокрашенных петель", 488300, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 2, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Дополнительные ножницы", 728806, 1, "-", "-", "-", "-", "-", "-");
                              } else {
                                fill("Максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      } else {
                        fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      }
                    }
                  }
                }
              }
              break;
            case "Серый":
              document.getElementById("comm").innerHTML = "Для замены на ось 10мм необходимо заменить петли 488297 на 486497 ";
              if (p4 < 390) {
                fill("Минимальная ширина - 390мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
              } else {
                if (p4 < 700) {
                  console.log('Roto300 п/о белый  ширина 390-700мм ');
                  if (p5 < 580) {
                    fill("Минимальная высота - 580мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p5 < 1200) {
                      fill("Запорные элементы", 728804, 1, "Ножницы 400", 490172, 1, "Ручка ROTOLINE серая", 486161, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1800) {
                        fill("Запорные элементы", 728804, 1, "Ножницы 400", 490172, 1, "Ручка ROTOLINE серая", 486161, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 2400) {
                          fill("Запорные элементы", 728804, 1, "Ножницы 400", 490172, 1, "Ручка ROTOLINE серая", 486161, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          fill("Максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        }
                      }
                    }
                  }
                } else {
                  if (p4 < 1000) {
                    console.log('Roto300 п/о белый  ширина 700-1000мм ');
                    if (p5 < 580) {
                      fill("Минимальная высота - 580мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1200) {
                        fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE серая", 486161, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1800) {
                          fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE серая", 486161, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 2400) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE серая", 486161, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            fill("Максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          }
                        }
                      }
                    }
                  } else {
                    if (p4 < 1300) {
                      console.log('Roto300 п/о белый  ширина 1000-1300мм ');
                      if (p5 < 580) {
                        fill("Минимальная высота - 580мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1200) {
                          fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE серая", 486161, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1800) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE серая", 486161, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 2400) {
                              fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE серая", 486161, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 2, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            } else {
                              fill("Максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            }
                          }
                        }
                      }
                    } else {
                      if (p4 < 1600) {
                        console.log('Roto300 п/о белый  ширина 1300-1600мм');
                        if (p5 < 580) {
                          fill("Минимальная высота - 580мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1200) {
                            fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE серая", 486161, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 1, "Дополнительные ножницы", 728806, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1800) {
                              fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE серая", 486161, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 2, "Дополнительные ножницы", 728806, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 2400) {
                                fill("Запорные элементы", 728804, 1, "Ножницы 700", 490171, 1, "Ручка ROTOLINE серая", 486161, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Переключатель MV комп", 728842, 2, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Дополнительные ножницы", 728806, 1, "-", "-", "-", "-", "-", "-");
                              } else {
                                fill("Максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      } else {
                        fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      }
                    }
                  }
                }
              }
              break;
            default:
              console.log('RotoAl Поворотно-откидное Какой цвет ???');
          }
          break;
        case "Поворотное":
          document.getElementById("comm").hidden = true;
          document.getElementById("prim").hidden = true;
          switch (p3) {
            case "Белый":
              if (p4 < 370) {
                fill("Минимальная ширина - 370мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
              } else {
                if (p4 < 1300) {
                  console.log('Roto300 пов белый  ширина 370-1300мм ');
                  if (p5 < 500) {
                    fill("Минимальная высота - 500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p5 < 1200) {
                      fill("Запорные элементы", 728756, 1, "Верхняя петля створки", 486537, 1, "Ручка ROTOLINE белая", 486163, 1, "Комплект белых петель", 488299, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1800) {
                        fill("Запорные элементы", 728756, 1, "Верхняя петля створки", 486537, 1, "Ручка ROTOLINE белая", 486163, 1, "Комплект белых петель", 488299, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1, "Средний прижим на створке", 728884, 1, "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 2250) {
                          fill("Запорные элементы", 728756, 1, "Верхняя петля створки", 486537, 1, "Ручка ROTOLINE белая", 486163, 1, "Комплект белых петель", 488299, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2, "Средний прижим на створке", 728884, 2, "-", "-", "-", "-", "-", "-");
                        } else {
                          fill("Максимальная высота - 2250мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        }
                      }
                    }
                  }
                } else {
                  if (p4 < 1600) {
                    console.log('Roto300 пов белый  ширина 1300-1600мм ');
                    if (p5 < 500) {
                      fill("Минимальная высота - 500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1200) {
                        fill("Запорные элементы", 728743, 1, "Верхняя петля створки", 486537, 1, "Ручка ROTOLINE белая", 486163, 1, "Комплект белых петель", 488299, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1800) {
                          fill("Запорные элементы", 728743, 1, "Верхняя петля створки", 486537, 1, "Ручка ROTOLINE белая", 486163, 1, "Комплект белых петель", 488299, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1, "Средний прижим на створке", 728884, 1, "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 2250) {
                            fill("Запорные элементы", 728743, 1, "Верхняя петля створки", 486537, 1, "Ручка ROTOLINE белая", 486163, 1, "Комплект белых петель", 488299, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2, "Средний прижим на створке", 728884, 2, "-", "-", "-", "-", "-", "-");
                          } else {
                            fill("Максимальная высота - 2250мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          }
                        }
                      }
                    }
                  } else {
                    fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  }
                }
              }
              break;
            case "Неокрас":
              if (p4 < 405) {
                fill("Минимальная ширина - 405мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
              } else {
                if (p4 < 1300) {
                  console.log('Roto300 пов Неокрас ширина 405-1300мм ');
                  if (p5 < 520) {
                    fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p5 < 1200) {
                      fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE неокрас", 486165, 1, "Комплект петель неокрас", 488300, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1800) {
                        fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE неокрас", 486165, 1, "Комплект петель неокрас", 488300, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1, "Средний прижим на створке", 728884, 1, "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 2400) {
                          fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE неокрас", 486165, 1, "Комплект петель неокрас", 488300, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2, "Средний прижим на створке", 728884, 2, "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 2700) {
                            fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE неокрас", 486165, 1, "Комплект петель неокрас", 488300, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3, "Средний прижим на створке", 728884, 3, "-", "-", "-", "-", "-", "-");
                          } else {
                            fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          }
                        }
                      }
                    }
                  }
                } else {
                  if (p4 < 1600) {
                    console.log('Roto300 пов Неокрас ширина 1300-1600мм');
                    if (p5 < 520) {
                      fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1200) {
                        fill("Запорные элементы", 728743, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE неокрас", 486165, 1, "Комплект петель неокрас", 488300, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1800) {
                          fill("Запорные элементы", 728743, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE неокрас", 486165, 1, "Комплект петель неокрас", 488300, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1, "Средний прижим на створке", 728884, 1, "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 2400) {
                            fill("Запорные элементы", 728743, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE неокрас", 486165, 1, "Комплект петель неокрас", 488300, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2, "Средний прижим на створке", 728884, 2, "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 2700) {
                              fill("Запорные элементы", 728743, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE неокрас", 486165, 1, "Комплект петель неокрас", 488300, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3, "Средний прижим на створке", 728884, 3, "-", "-", "-", "-", "-", "-");
                            } else {
                              fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            }
                          }
                        }
                      }
                    }
                  } else {
                    fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  }
                }
              }
              break;
            case "Серый":
              if (p4 < 405) {
                fill("Минимальная ширина - 405мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
              } else {
                if (p4 < 1300) {
                  console.log('Roto300 пов Серый ширина 405-1300мм ');
                  if (p5 < 520) {
                    fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p5 < 1200) {
                      fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE серая", 486161, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1800) {
                        fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE серая", 486161, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1, "Средний прижим на створке", 728884, 1, "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 2400) {
                          fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE серая", 486161, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2, "Средний прижим на створке", 728884, 2, "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 2700) {
                            fill("Запорные элементы", 728756, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE серая", 486161, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3, "Средний прижим на створке", 728884, 3, "-", "-", "-", "-", "-", "-");
                          } else {
                            fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          }
                        }
                      }
                    }
                  }
                } else {
                  if (p4 < 1600) {
                    console.log('Roto300 пов Серый ширина 1300-1600мм');
                    if (p5 < 520) {
                      fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1200) {
                        fill("Запорные элементы", 728743, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE серая", 486161, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1800) {
                          fill("Запорные элементы", 728743, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE серая", 486161, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1, "Средний прижим на створке", 728884, 1, "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 2400) {
                            fill("Запорные элементы", 728743, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE серая", 486161, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2, "Средний прижим на створке", 728884, 2, "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 2700) {
                              fill("Запорные элементы", 728743, 1, "Подпятник", 212008, 1, "Ручка ROTOLINE серая", 486161, 1, "Комплект серых петель", 488297, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3, "Средний прижим на створке", 728884, 3, "-", "-", "-", "-", "-", "-");
                            } else {
                              fill("Максимальная высота - 2700мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            }
                          }
                        }
                      }
                    }
                  } else {
                    fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  }
                }
              }
              break;
            default:
              console.log('RotoAl Поворотное Какой цвет ???');
          }
          break;
        case "Фрамужное":
          document.getElementById("comm").hidden = true;
          document.getElementById("prim").hidden = true;
          switch (p3) {
            case "Белый":
              if (p4 < 500) {
                fill("Минимальная ширина - 500мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
              } else {
                if (p4 < 1100) {
                  console.log('Roto300 фрам белый  ширина 500-1100мм ');
                  if (p5 < 370) {
                    fill("Минимальная высота - 370мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p5 < 1300) {
                      fill("Запорный комплект", 728756, 1, "Ручка ROTOLINE белая", 486163, 1, "Белые фрамужные петли", 486482, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Фрамужные ножницы", 728862, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    }
                  }
                } else {
                  if (p4 < 1600) {
                    console.log('Roto300 фрам белый  ширина 1100-1600мм');
                    if (p5 < 370) {
                      fill("Минимальная высота - 370мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1300) {
                        fill("Запорный комплект", 728756, 1, "Ручка ROTOLINE белая", 486163, 1, "Белые фрамужные петли", 486482, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Фрамужные ножницы", 728862, 2, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1, "Средний прижим на створке", 728884, 1, "-", "-", "-", "-", "-", "-");
                      } else {
                        fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      }
                    }
                  } else {
                    fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  }
                }
              }
              break;
            case "Неокрас":
              if (p4 < 500) {
                fill("Минимальная ширина - 500мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
              } else {
                if (p4 < 1100) {
                  console.log('Roto300 фрам белый  ширина 500-1100мм ');
                  if (p5 < 370) {
                    fill("Минимальная высота - 370мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p5 < 1300) {
                      fill("Запорный комплект", 728756, 1, "Ручка ROTOLINE неокрас", 486165, 1, "Фрамужные петли неокрас", 486483, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Фрамужные ножницы", 728862, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    }
                  }
                } else {
                  if (p4 < 1600) {
                    console.log('Roto300 фрам белый  ширина 1100-1600мм');
                    if (p5 < 370) {
                      fill("Минимальная высота - 370мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1300) {
                        fill("Запорный комплект", 728756, 1, "Ручка ROTOLINE неокрас", 486165, 1, "Фрамужные петли неокрас", 486483, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Фрамужные ножницы", 728862, 2, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1, "Средний прижим на створке", 728884, 1, "-", "-", "-", "-", "-", "-");
                      } else {
                        fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      }
                    }
                  } else {
                    fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  }
                }
              }
              break;
            case "Серый":
              if (p4 < 500) {
                fill("Минимальная ширина - 500мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
              } else {
                if (p4 < 1100) {
                  console.log('Roto300 фрам белый  ширина 500-1100мм ');
                  if (p5 < 370) {
                    fill("Минимальная высота - 370мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p5 < 1300) {
                      fill("Запорный комплект", 728756, 1, "Ручка ROTOLINE серая", 486161, 1, "Фрамужные петли серые", 486480, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Фрамужные ножницы", 728862, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    }
                  }
                } else {
                  if (p4 < 1600) {
                    console.log('Roto300 фрам белый  ширина 1100-1600мм');
                    if (p5 < 370) {
                      fill("Минимальная высота - 370мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                    } else {
                      if (p5 < 1300) {
                        fill("Запорный комплект", 728756, 1, "Ручка ROTOLINE серая", 486161, 1, "Фрамужные петли серые", 486480, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Фрамужные ножницы", 728862, 2, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1, "Средний прижим на створке", 728884, 1, "-", "-", "-", "-", "-", "-");
                      } else {
                        fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      }
                    }
                  } else {
                    fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  }
                }
              }
              break;
            default:
              console.log('RotoAl Фрамужное Какой цвет ???');
          }
          break;
        default:
          console.log('RotoAl Какое открывание ??? Какой цвет ???');
      }
      break;
    case "Roto Designio Al":
      switch (p6) {
        case "Правая":
          switch (p2) {
            case "Поворотно-откидное":
              document.getElementById("comm").hidden = false;
              document.getElementById("prim").hidden = false;
              switch (p3) {
                case "Белый":
                  document.getElementById("comm").innerHTML = "Для створок весом более 100кг необходимо добавить на каждую створку комплект усиления до 150кг - 739693 ";
                  if (p4 < 390) {
                    fill("Минимальная ширина - 390мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p4 < 500) {
                      console.log('Designio п/о белый  ширина 390-500мм ');
                      fill2("-", "-", "-", "-", "-", "-");
                      if (p5 < 555) {
                        fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 390", 740856, 1, "Переключатель MV комп.", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1800) {
                            fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 390", 740856, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 2400) {
                              fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 390", 740856, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 2500) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 390", 740856, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-", "-", "-", "-");
                              } else {
                                fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    } else {
                      if (p4 < 735) {
                        console.log('Designio п/о белый  ширина 500-735мм ');
                        fill2("-", "-", "-", "-", "-", "-");
                        if (p5 < 555) {
                          fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 500", 624956, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1800) {
                              fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 500", 624956, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                            } else {
                              if (p5 < 2400) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 500", 624956, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-");
                              } else {
                                if (p5 < 2500) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 500", 624956, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-");
                                } else {
                                  fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        }
                      } else {
                        if (p4 < 1000) {
                          console.log('Designio п/о белый  ширина 735-1000мм ');
                          fill2("-", "-", "-", "-", "-", "-");
                          if (p5 < 555) {
                            fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1300) {
                              fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                            } else {
                              if (p5 < 1800) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                              } else {
                                if (p5 < 2400) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-");
                                } else {
                                  if (p5 < 2500) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-");
                                  } else {
                                    fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                  }
                                }
                              }
                            }
                          }
                        } else {
                          if (p4 < 1200) {
                            console.log('Designio п/о белый  ширина 1000-1200мм ');
                            fill2("-", "-", "-", "-", "-", "-");
                            if (p5 < 555) {
                              fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 1300) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              } else {
                                if (p5 < 1800) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                                } else {
                                  if (p5 < 2400) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-");
                                  } else {
                                    if (p5 < 2500) {
                                      fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-");
                                    } else {
                                      fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                    }
                                  }
                                }
                              }
                            }
                          } else {
                            if (p4 < 1300) {
                              console.log('Designio п/о белый  ширина 1200-1300мм ');
                              fill2("-", "-", "-", "-", "-", "-");
                              if (p5 < 555) {
                                fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              } else {
                                if (p5 < 1300) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ограничитель открывания", 740814, 1, "-", "-", "-", "-", "-", "-");
                                } else {
                                  if (p5 < 1800) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "Ограничитель открывания", 740814, 1);
                                  } else {
                                    if (p5 < 2400) {
                                      fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "Ограничитель открывания", 740814, 1);
                                    } else {
                                      fill("При ширине створки более 1200мм, максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                    }
                                  }
                                }
                              }
                            } else {
                              if (p4 < 1600) {
                                console.log('Designio п/о белый  ширина 1300-1600мм');
                                if (p5 < 555) {
                                  fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                } else {
                                  if (p5 < 1300) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ограничитель открывания", 740814, 1, "Дополнительные ножницы", 728806, 1, "-", "-", "-");
                                  } else {
                                    if (p5 < 1800) {
                                      fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "Ограничитель открывания", 740814, 1);
                                      fill2("Дополнительные ножницы", 728806, 1);
                                    } else {
                                      if (p5 < 2400) {
                                        fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 2, "Цапфа запорная", 334671, 2, "Ограничитель открывания", 740814, 1);
                                        fill2("Дополнительные ножницы", 728806, 1, "-", "-", "-");
                                      } else {
                                        fill("При ширине створки более 1200мм, максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                      }
                                    }
                                  }
                                }
                              } else {
                                fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                  break;
                case "Неокрас":
                  document.getElementById("comm").innerHTML = "Для створок весом более 100кг необходимо добавить на каждую створку комплект усиления до 150кг - 739693 ";
                  if (p4 < 390) {
                    fill("Минимальная ширина - 390мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p4 < 500) {
                      console.log('Designio п/о белый  ширина 390-500мм ');
                      fill2("-", "-", "-", "-", "-", "-");
                      if (p5 < 555) {
                        fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 390", 740856, 1, "Переключатель MV комп.", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1800) {
                            fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 390", 740856, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 2400) {
                              fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 390", 740856, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 2500) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 390", 740856, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-", "-", "-", "-");
                              } else {
                                fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    } else {
                      if (p4 < 735) {
                        console.log('Designio п/о белый  ширина 500-735мм ');
                        fill2("-", "-", "-", "-", "-", "-");
                        if (p5 < 555) {
                          fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 500", 624956, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1800) {
                              fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 500", 624956, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                            } else {
                              if (p5 < 2400) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 500", 624956, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-");
                              } else {
                                if (p5 < 2500) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 500", 624956, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-");
                                } else {
                                  fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        }
                      } else {
                        if (p4 < 1000) {
                          console.log('Designio п/о белый  ширина 735-1000мм ');
                          fill2("-", "-", "-", "-", "-", "-");
                          if (p5 < 555) {
                            fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1300) {
                              fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                            } else {
                              if (p5 < 1800) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                              } else {
                                if (p5 < 2400) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-");
                                } else {
                                  if (p5 < 2500) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-");
                                  } else {
                                    fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                  }
                                }
                              }
                            }
                          }
                        } else {
                          if (p4 < 1200) {
                            console.log('Designio п/о белый  ширина 1000-1200мм ');
                            fill2("-", "-", "-", "-", "-", "-");
                            if (p5 < 555) {
                              fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 1300) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              } else {
                                if (p5 < 1800) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                                } else {
                                  if (p5 < 2400) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-");
                                  } else {
                                    if (p5 < 2500) {
                                      fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-");
                                    } else {
                                      fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                    }
                                  }
                                }
                              }
                            }
                          } else {
                            if (p4 < 1300) {
                              console.log('Designio п/о белый  ширина 1200-1300мм ');
                              fill2("-", "-", "-", "-", "-", "-");
                              if (p5 < 555) {
                                fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              } else {
                                if (p5 < 1300) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ограничитель открывания", 740814, 1, "-", "-", "-", "-", "-", "-");
                                } else {
                                  if (p5 < 1800) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "Ограничитель открывания", 740814, 1);
                                  } else {
                                    if (p5 < 2400) {
                                      fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "Ограничитель открывания", 740814, 1);
                                    } else {
                                      fill("При ширине створки более 1200мм, максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                    }
                                  }
                                }
                              }
                            } else {
                              if (p4 < 1600) {
                                console.log('Designio п/о белый  ширина 1300-1600мм');
                                if (p5 < 555) {
                                  fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                } else {
                                  if (p5 < 1300) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ограничитель открывания", 740814, 1, "Дополнительные ножницы", 728806, 1, "-", "-", "-");
                                  } else {
                                    if (p5 < 1800) {
                                      fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "Ограничитель открывания", 740814, 1);
                                      fill2("Дополнительные ножницы", 728806, 1);
                                    } else {
                                      if (p5 < 2400) {
                                        fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 2, "Цапфа запорная", 334671, 2, "Ограничитель открывания", 740814, 1);
                                        fill2("Дополнительные ножницы", 728806, 1, "-", "-", "-");
                                      } else {
                                        fill("При ширине створки более 1200мм, максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                      }
                                    }
                                  }
                                }
                              } else {
                                fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                  break;
                case "Серый":
                  document.getElementById("comm").innerHTML = "Для створок весом более 100кг необходимо добавить на каждую створку комплект усиления до 150кг - 739693 ";
                  if (p4 < 390) {
                    fill("Минимальная ширина - 390мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p4 < 500) {
                      console.log('Designio п/о белый  ширина 390-500мм ');
                      fill2("-", "-", "-", "-", "-", "-");
                      if (p5 < 555) {
                        fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 390", 740856, 1, "Переключатель MV комп.", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1800) {
                            fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 390", 740856, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 2400) {
                              fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 390", 740856, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 2500) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 390", 740856, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-", "-", "-", "-");
                              } else {
                                fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    } else {
                      if (p4 < 735) {
                        console.log('Designio п/о белый  ширина 500-735мм ');
                        fill2("-", "-", "-", "-", "-", "-");
                        if (p5 < 555) {
                          fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 500", 624956, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1800) {
                              fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 500", 624956, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                            } else {
                              if (p5 < 2400) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 500", 624956, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-");
                              } else {
                                if (p5 < 2500) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 500", 624956, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-");
                                } else {
                                  fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        }
                      } else {
                        if (p4 < 1000) {
                          console.log('Designio п/о белый  ширина 735-1000мм ');
                          fill2("-", "-", "-", "-", "-", "-");
                          if (p5 < 555) {
                            fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1300) {
                              fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                            } else {
                              if (p5 < 1800) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                              } else {
                                if (p5 < 2400) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-");
                                } else {
                                  if (p5 < 2500) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-");
                                  } else {
                                    fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                  }
                                }
                              }
                            }
                          }
                        } else {
                          if (p4 < 1200) {
                            console.log('Designio п/о белый  ширина 1000-1200мм ');
                            fill2("-", "-", "-", "-", "-", "-");
                            if (p5 < 555) {
                              fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 1300) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              } else {
                                if (p5 < 1800) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                                } else {
                                  if (p5 < 2400) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-");
                                  } else {
                                    if (p5 < 2500) {
                                      fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-");
                                    } else {
                                      fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                    }
                                  }
                                }
                              }
                            }
                          } else {
                            if (p4 < 1300) {
                              console.log('Designio п/о белый  ширина 1200-1300мм ');
                              fill2("-", "-", "-", "-", "-", "-");
                              if (p5 < 555) {
                                fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              } else {
                                if (p5 < 1300) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ограничитель открывания", 740814, 1, "-", "-", "-", "-", "-", "-");
                                } else {
                                  if (p5 < 1800) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "Ограничитель открывания", 740814, 1);
                                  } else {
                                    if (p5 < 2400) {
                                      fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "Ограничитель открывания", 740814, 1);
                                    } else {
                                      fill("При ширине створки более 1200мм, максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                    }
                                  }
                                }
                              }
                            } else {
                              if (p4 < 1600) {
                                console.log('Designio п/о белый  ширина 1300-1600мм');
                                if (p5 < 555) {
                                  fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                } else {
                                  if (p5 < 1300) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ограничитель открывания", 740814, 1, "Дополнительные ножницы", 728806, 1, "-", "-", "-");
                                  } else {
                                    if (p5 < 1800) {
                                      fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "Ограничитель открывания", 740814, 1);
                                      fill2("Дополнительные ножницы", 728806, 1);
                                    } else {
                                      if (p5 < 2400) {
                                        fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме 735", 624958, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 2, "Цапфа запорная", 334671, 2, "Ограничитель открывания", 740814, 1);
                                        fill2("Дополнительные ножницы", 728806, 1, "-", "-", "-");
                                      } else {
                                        fill("При ширине створки более 1200мм, максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                      }
                                    }
                                  }
                                }
                              } else {
                                fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                  break;
                default:
                  console.log('RotoAl Поворотно-откидное Какой цвет ???');
              }
              break;
            case "Поворотное":
              document.getElementById("comm").hidden = true;
              document.getElementById("prim").hidden = true;
              switch (p3) {
                case "Белый":
                  if (p4 < 500) {
                    fill("Минимальная ширина - 500мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p4 < 1000) {
                      console.log('Designio пов белый  ширина 500-1000мм ');
                      if (p5 < 520) {
                        fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1800) {
                            fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1);
                            fill2("Средний прижим на створке", 728884, 1, "-", "-", "-");
                          } else {
                            if (p5 < 2400) {
                              fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2);
                              fill2("Средний прижим на створке", 728884, 2, "-", "-", "-");
                            } else {
                              if (p5 < 2500) {
                                fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3);
                                fill2("Средний прижим на створке", 728884, 3, "-", "-", "-");
                              } else {
                                fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    } else {
                      if (p4 < 1200) {
                        console.log('Designio пов белый  ширина 1000-1200мм ');
                        if (p5 < 520) {
                          fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1800) {
                              fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1);
                              fill2("Средний прижим на створке", 728884, 1, "-", "-", "-");
                            } else {
                              if (p5 < 2400) {
                                fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2);
                                fill2("Средний прижим на створке", 728884, 2, "-", "-", "-");
                              } else {
                                if (p5 < 2500) {
                                  fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3);
                                  fill2("Средний прижим на створке", 728884, 3, "-", "-", "-");
                                } else {
                                  fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        }
                      } else {
                        if (p4 < 1600) {
                          console.log('Designio пов белый  ширина 1200-1600мм ');
                          if (p5 < 520) {
                            fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1300) {
                              fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ограничитель открывания", 740814, 1, "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 1800) {
                                fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1);
                                fill2("Средний прижим на створке", 728884, 1, "Ограничитель открывания", 740814, 1);
                              } else {
                                if (p5 < 2400) {
                                  fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2);
                                  fill2("Средний прижим на створке", 728884, 2, "Ограничитель открывания", 740814, 1);
                                } else {
                                  fill("При ширине створки более 1200мм, максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                  fill2("-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        } else {
                          fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        }
                      }
                    }
                  }
                  break;
                case "Неокрас":
                  if (p4 < 500) {
                    fill("Минимальная ширина - 500мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p4 < 1000) {
                      console.log('Designio пов белый  ширина 500-1000мм ');
                      if (p5 < 520) {
                        fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1800) {
                            fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1);
                            fill2("Средний прижим на створке", 728884, 1, "-", "-", "-");
                          } else {
                            if (p5 < 2400) {
                              fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2);
                              fill2("Средний прижим на створке", 728884, 2, "-", "-", "-");
                            } else {
                              if (p5 < 2500) {
                                fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3);
                                fill2("Средний прижим на створке", 728884, 3, "-", "-", "-");
                              } else {
                                fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    } else {
                      if (p4 < 1200) {
                        console.log('Designio пов белый  ширина 1000-1200мм ');
                        if (p5 < 520) {
                          fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1800) {
                              fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1);
                              fill2("Средний прижим на створке", 728884, 1, "-", "-", "-");
                            } else {
                              if (p5 < 2400) {
                                fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2);
                                fill2("Средний прижим на створке", 728884, 2, "-", "-", "-");
                              } else {
                                if (p5 < 2500) {
                                  fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3);
                                  fill2("Средний прижим на створке", 728884, 3, "-", "-", "-");
                                } else {
                                  fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        }
                      } else {
                        if (p4 < 1600) {
                          console.log('Designio пов белый  ширина 1200-1600мм ');
                          if (p5 < 520) {
                            fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1300) {
                              fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ограничитель открывания", 740814, 1, "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 1800) {
                                fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1);
                                fill2("Средний прижим на створке", 728884, 1, "Ограничитель открывания", 740814, 1);
                              } else {
                                if (p5 < 2400) {
                                  fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2);
                                  fill2("Средний прижим на створке", 728884, 2, "Ограничитель открывания", 740814, 1);
                                } else {
                                  fill("При ширине створки более 1200мм, максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                  fill2("-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        } else {
                          fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        }
                      }
                    }
                  }
                  break;
                case "Серый":
                  if (p4 < 500) {
                    fill("Минимальная ширина - 500мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p4 < 1000) {
                      console.log('Designio пов белый  ширина 500-1000мм ');
                      if (p5 < 520) {
                        fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1800) {
                            fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1);
                            fill2("Средний прижим на створке", 728884, 1, "-", "-", "-");
                          } else {
                            if (p5 < 2400) {
                              fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2);
                              fill2("Средний прижим на створке", 728884, 2, "-", "-", "-");
                            } else {
                              if (p5 < 2500) {
                                fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3);
                                fill2("Средний прижим на створке", 728884, 3, "-", "-", "-");
                              } else {
                                fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    } else {
                      if (p4 < 1200) {
                        console.log('Designio пов белый  ширина 1000-1200мм ');
                        if (p5 < 520) {
                          fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1800) {
                              fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1);
                              fill2("Средний прижим на створке", 728884, 1, "-", "-", "-");
                            } else {
                              if (p5 < 2400) {
                                fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2);
                                fill2("Средний прижим на створке", 728884, 2, "-", "-", "-");
                              } else {
                                if (p5 < 2500) {
                                  fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3);
                                  fill2("Средний прижим на створке", 728884, 3, "-", "-", "-");
                                } else {
                                  fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        }
                      } else {
                        if (p4 < 1600) {
                          console.log('Designio пов белый  ширина 1200-1600мм ');
                          if (p5 < 520) {
                            fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1300) {
                              fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ограничитель открывания", 740814, 1, "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 1800) {
                                fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1);
                                fill2("Средний прижим на створке", 728884, 1, "Ограничитель открывания", 740814, 1);
                              } else {
                                if (p5 < 2400) {
                                  fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624973, 1, "Нижняя петля на створке", 739699, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2);
                                  fill2("Средний прижим на створке", 728884, 2, "Ограничитель открывания", 740814, 1);
                                } else {
                                  fill("При ширине створки более 1200мм, максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                  fill2("-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        } else {
                          fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        }
                      }
                    }
                  }
                  break;
                default:
                  console.log('RotoAl Поворотно-откидное Какой цвет ???');
              }
              break;
            case "Фрамужное":
              document.getElementById("comm").hidden = true;
              document.getElementById("prim").hidden = true;
              switch (p3) {
                case "Белый":
                  console.log('Roto Designio Фрамужное Белый');
                  if (p4 < 520) {
                    fill("Минимальная ширина - 520мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p4 < 1100) {
                      console.log('RotoAl фрам белый  ширина 500-1100мм ');
                      if (p5 < 500) {
                        fill("Минимальная высота - 500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Фрамужные ножницы", 728862, 2, "Ручка ROTOLINE белая", 377477, 1, "Ножницы", 627259, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Подпятник", 212008, 1, "Петля на створке", 740811, 2, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          fill2("-", "-", "-", "-", "-", "-");
                        } else {
                          fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        }
                      }
                    } else {
                      if (p4 < 1600) {
                        console.log('RotoAl фрам белый  ширина 1100-1600мм');
                        if (p5 < 500) {
                          fill("Минимальная высота - 500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Фрамужные ножницы", 728862, 2, "Ручка ROTOLINE белая", 377477, 1, "Ножницы", 627259, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Подпятник", 212008, 1, "Петля на створке", 740811, 2, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Доп. прижим на раме", 728885, 1, "Доп. прижим на створке", 728884, 1, "-", "-", "-");
                            fill2("-", "-", "-", "-", "-", "-");
                          } else {
                            fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          }
                        }
                      } else {
                        fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      }
                    }
                  }
                  break;
                case "Неокрас":
                  console.log('Roto Designio Фрамужное Неокрас');
                  if (p4 < 520) {
                    fill("Минимальная ширина - 520мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p4 < 1100) {
                      console.log('RotoAl фрам белый  ширина 500-1100мм ');
                      if (p5 < 500) {
                        fill("Минимальная высота - 500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Фрамужные ножницы", 728862, 2, "Ручка ROTOLINE неокрас", 238680, 1, "Ножницы", 627259, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Подпятник", 212008, 1, "Петля на створке", 740811, 2, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          fill2("-", "-", "-", "-", "-", "-");
                        } else {
                          fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        }
                      }
                    } else {
                      if (p4 < 1600) {
                        console.log('RotoAl фрам белый  ширина 1100-1600мм');
                        if (p5 < 500) {
                          fill("Минимальная высота - 500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Фрамужные ножницы", 728862, 2, "Ручка ROTOLINE неокрас", 238680, 1, "Ножницы", 627259, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Подпятник", 212008, 1, "Петля на створке", 740811, 2, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Доп. прижим на раме", 728885, 1, "Доп. прижим на створке", 728884, 1, "-", "-", "-");
                            fill2("-", "-", "-", "-", "-", "-");
                          } else {
                            fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          }
                        }
                      } else {
                        fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      }
                    }
                  }
                  break;
                case "Серый":
                  console.log('Roto Designio Фрамужное Серый');
                  if (p4 < 520) {
                    fill("Минимальная ширина - 520мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p4 < 1100) {
                      console.log('RotoAl фрам белый  ширина 500-1100мм ');
                      if (p5 < 500) {
                        fill("Минимальная высота - 500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Фрамужные ножницы", 728862, 2, "Ручка ROTOLINE серая", 377474, 1, "Ножницы", 627259, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Подпятник", 212008, 1, "Петля на створке", 740811, 2, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          fill2("-", "-", "-", "-", "-", "-");
                        } else {
                          fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        }
                      }
                    } else {
                      if (p4 < 1600) {
                        console.log('RotoAl фрам белый  ширина 1100-1600мм');
                        if (p5 < 500) {
                          fill("Минимальная высота - 500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Фрамужные ножницы", 728862, 2, "Ручка ROTOLINE серая", 377474, 1, "Ножницы", 627259, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Подпятник", 212008, 1, "Петля на створке", 740811, 2, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Доп. прижим на раме", 728885, 1, "Доп. прижим на створке", 728884, 1, "-", "-", "-");
                            fill2("-", "-", "-", "-", "-", "-");
                          } else {
                            fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          }
                        }
                      } else {
                        fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      }
                    }
                  }
                  break;
                default:
                  console.log('Roto Designio Фрамужное Какой цвет ???');
              }
              break;
            default:
              console.log('Roto Designio Какое открывание ??? Какой цвет ???');
          }
          break;
        /*.........................................................................................................................................................................*/
        case "Левая":
          switch (p2) {
            case "Поворотно-откидное":
              document.getElementById("comm").hidden = false;
              document.getElementById("prim").hidden = false;
              switch (p3) {
                case "Белый":
                  document.getElementById("comm").innerHTML = "Для створок весом более 100кг необходимо добавить на каждую створку комплект усиления до 150кг - 739694";
                  if (p4 < 390) {
                    fill("Минимальная ширина - 390мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p4 < 500) {
                      console.log('Designio п/о белый  ширина 390-500мм ');
                      fill2("-", "-", "-", "-", "-", "-");
                      if (p5 < 555) {
                        fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 390", 740855, 1, "Переключатель MV комп.", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1800) {
                            fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 390", 740855, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 2400) {
                              fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 390", 740855, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 2500) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 390", 740855, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-", "-", "-", "-");
                              } else {
                                fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    } else {
                      if (p4 < 735) {
                        console.log('Designio п/о белый  ширина 500-735мм ');
                        fill2("-", "-", "-", "-", "-", "-");
                        if (p5 < 555) {
                          fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 500", 624957, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1800) {
                              fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 500", 624957, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                            } else {
                              if (p5 < 2400) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 500", 624957, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-");
                              } else {
                                if (p5 < 2500) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 500", 624957, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-");
                                } else {
                                  fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        }
                      } else {
                        if (p4 < 1000) {
                          console.log('Designio п/о белый  ширина 735-1000мм ');
                          fill2("-", "-", "-", "-", "-", "-");
                          if (p5 < 555) {
                            fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1300) {
                              fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                            } else {
                              if (p5 < 1800) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                              } else {
                                if (p5 < 2400) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-");
                                } else {
                                  if (p5 < 2500) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-");
                                  } else {
                                    fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                  }
                                }
                              }
                            }
                          }
                        } else {
                          if (p4 < 1200) {
                            console.log('Designio п/о белый  ширина 1000-1200мм ');
                            fill2("-", "-", "-", "-", "-", "-");
                            if (p5 < 555) {
                              fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 1300) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              } else {
                                if (p5 < 1800) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                                } else {
                                  if (p5 < 2400) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-");
                                  } else {
                                    if (p5 < 2500) {
                                      fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-");
                                    } else {
                                      fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                    }
                                  }
                                }
                              }
                            }
                          } else {
                            if (p4 < 1300) {
                              console.log('Designio п/о белый  ширина 1200-1300мм ');
                              fill2("-", "-", "-", "-", "-", "-");
                              if (p5 < 555) {
                                fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              } else {
                                if (p5 < 1300) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ограничитель открывания", 740814, 1, "-", "-", "-", "-", "-", "-");
                                } else {
                                  if (p5 < 1800) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "Ограничитель открывания", 740814, 1);
                                  } else {
                                    if (p5 < 2400) {
                                      fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "Ограничитель открывания", 740814, 1);
                                    } else {
                                      fill("При ширине створки более 1200мм, максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                    }
                                  }
                                }
                              }
                            } else {
                              if (p4 < 1600) {
                                console.log('Designio п/о белый  ширина 1300-1600мм');
                                if (p5 < 555) {
                                  fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                } else {
                                  if (p5 < 1300) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ограничитель открывания", 740814, 1, "Дополнительные ножницы", 728806, 1, "-", "-", "-");
                                  } else {
                                    if (p5 < 1800) {
                                      fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "Ограничитель открывания", 740814, 1);
                                      fill2("Дополнительные ножницы", 728806, 1);
                                    } else {
                                      if (p5 < 2400) {
                                        fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 2, "Цапфа запорная", 334671, 2, "Ограничитель открывания", 740814, 1);
                                        fill2("Дополнительные ножницы", 728806, 1, "-", "-", "-");
                                      } else {
                                        fill("При ширине створки более 1200мм, максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                      }
                                    }
                                  }
                                }
                              } else {
                                fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                  break;
                case "Неокрас":
                  document.getElementById("comm").innerHTML = "Для створок весом более 100кг необходимо добавить на каждую створку комплект усиления до 150кг - 739694";
                  if (p4 < 390) {
                    fill("Минимальная ширина - 390мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p4 < 500) {
                      console.log('Designio п/о белый  ширина 390-500мм ');
                      fill2("-", "-", "-", "-", "-", "-");
                      if (p5 < 555) {
                        fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 390", 740855, 1, "Переключатель MV комп.", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1800) {
                            fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 390", 740855, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 2400) {
                              fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 390", 740855, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 2500) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 390", 740855, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-", "-", "-", "-");
                              } else {
                                fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    } else {
                      if (p4 < 735) {
                        console.log('Designio п/о белый  ширина 500-735мм ');
                        fill2("-", "-", "-", "-", "-", "-");
                        if (p5 < 555) {
                          fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 500", 624957, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1800) {
                              fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 500", 624957, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                            } else {
                              if (p5 < 2400) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 500", 624957, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-");
                              } else {
                                if (p5 < 2500) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 500", 624957, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-");
                                } else {
                                  fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        }
                      } else {
                        if (p4 < 1000) {
                          console.log('Designio п/о белый  ширина 735-1000мм ');
                          fill2("-", "-", "-", "-", "-", "-");
                          if (p5 < 555) {
                            fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1300) {
                              fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                            } else {
                              if (p5 < 1800) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                              } else {
                                if (p5 < 2400) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-");
                                } else {
                                  if (p5 < 2500) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-");
                                  } else {
                                    fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                  }
                                }
                              }
                            }
                          }
                        } else {
                          if (p4 < 1200) {
                            console.log('Designio п/о белый  ширина 1000-1200мм ');
                            fill2("-", "-", "-", "-", "-", "-");
                            if (p5 < 555) {
                              fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 1300) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              } else {
                                if (p5 < 1800) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                                } else {
                                  if (p5 < 2400) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-");
                                  } else {
                                    if (p5 < 2500) {
                                      fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-");
                                    } else {
                                      fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                    }
                                  }
                                }
                              }
                            }
                          } else {
                            if (p4 < 1300) {
                              console.log('Designio п/о белый  ширина 1200-1300мм ');
                              fill2("-", "-", "-", "-", "-", "-");
                              if (p5 < 555) {
                                fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              } else {
                                if (p5 < 1300) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ограничитель открывания", 740814, 1, "-", "-", "-", "-", "-", "-");
                                } else {
                                  if (p5 < 1800) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "Ограничитель открывания", 740814, 1);
                                  } else {
                                    if (p5 < 2400) {
                                      fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "Ограничитель открывания", 740814, 1);
                                    } else {
                                      fill("При ширине створки более 1200мм, максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                    }
                                  }
                                }
                              }
                            } else {
                              if (p4 < 1600) {
                                console.log('Designio п/о белый  ширина 1300-1600мм');
                                if (p5 < 555) {
                                  fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                } else {
                                  if (p5 < 1300) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ограничитель открывания", 740814, 1, "Дополнительные ножницы", 728806, 1, "-", "-", "-");
                                  } else {
                                    if (p5 < 1800) {
                                      fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "Ограничитель открывания", 740814, 1);
                                      fill2("Дополнительные ножницы", 728806, 1);
                                    } else {
                                      if (p5 < 2400) {
                                        fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 2, "Цапфа запорная", 334671, 2, "Ограничитель открывания", 740814, 1);
                                        fill2("Дополнительные ножницы", 728806, 1, "-", "-", "-");
                                      } else {
                                        fill("При ширине створки более 1200мм, максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                      }
                                    }
                                  }
                                }
                              } else {
                                fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                  break;
                case "Серый":
                  document.getElementById("comm").innerHTML = "Для створок весом более 100кг необходимо добавить на каждую створку комплект усиления до 150кг - 739694";
                  if (p4 < 390) {
                    fill("Минимальная ширина - 390мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p4 < 500) {
                      console.log('Designio п/о белый  ширина 390-500мм ');
                      fill2("-", "-", "-", "-", "-", "-");
                      if (p5 < 555) {
                        fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 390", 740855, 1, "Переключатель MV комп.", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1800) {
                            fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 390", 740855, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 2400) {
                              fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 390", 740855, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 2500) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 390", 740855, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-", "-", "-", "-");
                              } else {
                                fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    } else {
                      if (p4 < 735) {
                        console.log('Designio п/о белый  ширина 500-735мм ');
                        fill2("-", "-", "-", "-", "-", "-");
                        if (p5 < 555) {
                          fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 500", 624957, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1800) {
                              fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 500", 624957, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                            } else {
                              if (p5 < 2400) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 500", 624957, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-");
                              } else {
                                if (p5 < 2500) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 500", 624957, 1, "Ножницы на створке 500", 740836, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-");
                                } else {
                                  fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        }
                      } else {
                        if (p4 < 1000) {
                          console.log('Designio п/о белый  ширина 735-1000мм ');
                          fill2("-", "-", "-", "-", "-", "-");
                          if (p5 < 555) {
                            fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1300) {
                              fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                            } else {
                              if (p5 < 1800) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                              } else {
                                if (p5 < 2400) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-");
                                } else {
                                  if (p5 < 2500) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 1, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-");
                                  } else {
                                    fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                  }
                                }
                              }
                            }
                          }
                        } else {
                          if (p4 < 1200) {
                            console.log('Designio п/о белый  ширина 1000-1200мм ');
                            fill2("-", "-", "-", "-", "-", "-");
                            if (p5 < 555) {
                              fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 1300) {
                                fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              } else {
                                if (p5 < 1800) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "-", "-", "-");
                                } else {
                                  if (p5 < 2400) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "-", "-", "-");
                                  } else {
                                    if (p5 < 2500) {
                                      fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 5, "Цапфа запорная", 334671, 5, "-", "-", "-");
                                    } else {
                                      fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                    }
                                  }
                                }
                              }
                            }
                          } else {
                            if (p4 < 1300) {
                              console.log('Designio п/о белый  ширина 1200-1300мм ');
                              fill2("-", "-", "-", "-", "-", "-");
                              if (p5 < 555) {
                                fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              } else {
                                if (p5 < 1300) {
                                  fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ограничитель открывания", 740814, 1, "-", "-", "-", "-", "-", "-");
                                } else {
                                  if (p5 < 1800) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "Ограничитель открывания", 740814, 1);
                                  } else {
                                    if (p5 < 2400) {
                                      fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 3, "Цапфа запорная", 334671, 3, "Ограничитель открывания", 740814, 1);
                                    } else {
                                      fill("При ширине створки более 1200мм, максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                    }
                                  }
                                }
                              }
                            } else {
                              if (p4 < 1600) {
                                console.log('Designio п/о белый  ширина 1300-1600мм');
                                if (p5 < 555) {
                                  fill("Минимальная высота - 555мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                } else {
                                  if (p5 < 1300) {
                                    fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ограничитель открывания", 740814, 1, "Дополнительные ножницы", 728806, 1, "-", "-", "-");
                                  } else {
                                    if (p5 < 1800) {
                                      fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 1, "Цапфа запорная", 334671, 1, "Ограничитель открывания", 740814, 1);
                                      fill2("Дополнительные ножницы", 728806, 1);
                                    } else {
                                      if (p5 < 2400) {
                                        fill("Запорные элементы", 728804, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме 735", 624959, 1, "Ножницы на створке 735", 740838, 1, "Переключатель MV комп.", 728842, 2, "Ответная планка", 728918, 2, "Цапфа запорная", 334671, 2, "Ограничитель открывания", 740814, 1);
                                        fill2("Дополнительные ножницы", 728806, 1, "-", "-", "-");
                                      } else {
                                        fill("При ширине створки более 1200мм, максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                      }
                                    }
                                  }
                                }
                              } else {
                                fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                  break;
                default:
                  console.log('RotoAl Поворотно-откидное Какой цвет ???');
              }
              break;
            case "Поворотное":
              document.getElementById("comm").hidden = true;
              document.getElementById("prim").hidden = true;
              switch (p3) {
                case "Белый":
                  if (p4 < 500) {
                    fill("Минимальная ширина - 500мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p4 < 1000) {
                      console.log('Designio пов белый  ширина 500-1000мм ');
                      if (p5 < 520) {
                        fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1800) {
                            fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1);
                            fill2("Средний прижим на створке", 728884, 1, "-", "-", "-");
                          } else {
                            if (p5 < 2400) {
                              fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2);
                              fill2("Средний прижим на створке", 728884, 2, "-", "-", "-");
                            } else {
                              if (p5 < 2500) {
                                fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3);
                                fill2("Средний прижим на створке", 728884, 3, "-", "-", "-");
                              } else {
                                fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    } else {
                      if (p4 < 1200) {
                        console.log('Designio пов белый  ширина 1000-1200мм ');
                        if (p5 < 520) {
                          fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1800) {
                              fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1);
                              fill2("Средний прижим на створке", 728884, 1, "-", "-", "-");
                            } else {
                              if (p5 < 2400) {
                                fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2);
                                fill2("Средний прижим на створке", 728884, 2, "-", "-", "-");
                              } else {
                                if (p5 < 2500) {
                                  fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3);
                                  fill2("Средний прижим на створке", 728884, 3, "-", "-", "-");
                                } else {
                                  fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        }
                      } else {
                        if (p4 < 1600) {
                          console.log('Designio пов белый  ширина 1200-1600мм ');
                          if (p5 < 520) {
                            fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1300) {
                              fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ограничитель открывания", 740814, 1, "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 1800) {
                                fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1);
                                fill2("Средний прижим на створке", 728884, 1, "Ограничитель открывания", 740814, 1);
                              } else {
                                if (p5 < 2400) {
                                  fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE белая", 377477, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2);
                                  fill2("Средний прижим на створке", 728884, 2, "Ограничитель открывания", 740814, 1);
                                } else {
                                  fill("При ширине створки более 1200мм, максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                  fill2("-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        } else {
                          fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        }
                      }
                    }
                  }
                  break;
                case "Неокрас":
                  if (p4 < 500) {
                    fill("Минимальная ширина - 500мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p4 < 1000) {
                      console.log('Designio пов белый  ширина 500-1000мм ');
                      if (p5 < 520) {
                        fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1800) {
                            fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1);
                            fill2("Средний прижим на створке", 728884, 1, "-", "-", "-");
                          } else {
                            if (p5 < 2400) {
                              fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2);
                              fill2("Средний прижим на створке", 728884, 2, "-", "-", "-");
                            } else {
                              if (p5 < 2500) {
                                fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3);
                                fill2("Средний прижим на створке", 728884, 3, "-", "-", "-");
                              } else {
                                fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    } else {
                      if (p4 < 1200) {
                        console.log('Designio пов белый  ширина 1000-1200мм ');
                        if (p5 < 520) {
                          fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1800) {
                              fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1);
                              fill2("Средний прижим на створке", 728884, 1, "-", "-", "-");
                            } else {
                              if (p5 < 2400) {
                                fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2);
                                fill2("Средний прижим на створке", 728884, 2, "-", "-", "-");
                              } else {
                                if (p5 < 2500) {
                                  fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3);
                                  fill2("Средний прижим на створке", 728884, 3, "-", "-", "-");
                                } else {
                                  fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        }
                      } else {
                        if (p4 < 1600) {
                          console.log('Designio пов белый  ширина 1200-1600мм ');
                          if (p5 < 520) {
                            fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1300) {
                              fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ограничитель открывания", 740814, 1, "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 1800) {
                                fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1);
                                fill2("Средний прижим на створке", 728884, 1, "Ограничитель открывания", 740814, 1);
                              } else {
                                if (p5 < 2400) {
                                  fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE неокрас", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2);
                                  fill2("Средний прижим на створке", 728884, 2, "Ограничитель открывания", 740814, 1);
                                } else {
                                  fill("При ширине створки более 1200мм, максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                  fill2("-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        } else {
                          fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        }
                      }
                    }
                  }
                  break;
                case "Серый":
                  if (p4 < 500) {
                    fill("Минимальная ширина - 500мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p4 < 1000) {
                      console.log('Designio пов белый  ширина 500-1000мм ');
                      if (p5 < 520) {
                        fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1800) {
                            fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1);
                            fill2("Средний прижим на створке", 728884, 1, "-", "-", "-");
                          } else {
                            if (p5 < 2400) {
                              fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2);
                              fill2("Средний прижим на створке", 728884, 2, "-", "-", "-");
                            } else {
                              if (p5 < 2500) {
                                fill("Запорные элементы", 728756, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3);
                                fill2("Средний прижим на створке", 728884, 3, "-", "-", "-");
                              } else {
                                fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                              }
                            }
                          }
                        }
                      }
                    } else {
                      if (p4 < 1200) {
                        console.log('Designio пов белый  ширина 1000-1200мм ');
                        if (p5 < 520) {
                          fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1800) {
                              fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1);
                              fill2("Средний прижим на створке", 728884, 1, "-", "-", "-");
                            } else {
                              if (p5 < 2400) {
                                fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2);
                                fill2("Средний прижим на створке", 728884, 2, "-", "-", "-");
                              } else {
                                if (p5 < 2500) {
                                  fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Средний прижим на раме", 728885, 3);
                                  fill2("Средний прижим на створке", 728884, 3, "-", "-", "-");
                                } else {
                                  fill("Максимальная высота - 2500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        }
                      } else {
                        if (p4 < 1600) {
                          console.log('Designio пов белый  ширина 1200-1600мм ');
                          if (p5 < 520) {
                            fill("Минимальная высота - 520мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          } else {
                            if (p5 < 1300) {
                              fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 377474, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ограничитель открывания", 740814, 1, "-", "-", "-", "-", "-", "-");
                            } else {
                              if (p5 < 1800) {
                                fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 1, "Запорная цапфа", 334671, 1, "Средний прижим на раме", 728885, 1);
                                fill2("Средний прижим на створке", 728884, 1, "Ограничитель открывания", 740814, 1);
                              } else {
                                if (p5 < 2400) {
                                  fill("Запорные элементы", 728743, 1, "T-Приемник ", 334754, 1, "Ручка ROTOLINE серая", 238680, 1, "Опора под ручку", 770712, 1, "Нижняя петля на раме", 624974, 1, "Нижняя петля на створке", 739700, 1, "Ножницы на раме", 627259, 1, "Ножницы на створке", 740811, 1, "Подпятник", 212008, 1, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "Средний прижим на раме", 728885, 2);
                                  fill2("Средний прижим на створке", 728884, 2, "Ограничитель открывания", 740814, 1);
                                } else {
                                  fill("При ширине створки более 1200мм, максимальная высота - 2400мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                                  fill2("-", "-", "-", "-", "-", "-", "-");
                                }
                              }
                            }
                          }
                        } else {
                          fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        }
                      }
                    }
                  }
                  break;
                default:
                  console.log('RotoAl Поворотно-откидное Какой цвет ???');
              }
              break;
            case "Фрамужное":
              document.getElementById("comm").hidden = true;
              document.getElementById("prim").hidden = true;
              switch (p3) {
                case "Белый":
                  console.log('Roto Designio Фрамужное Белый');
                  if (p4 < 520) {
                    fill("Минимальная ширина - 520мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p4 < 1100) {
                      console.log('RotoAl фрам белый  ширина 500-1100мм ');
                      if (p5 < 500) {
                        fill("Минимальная высота - 500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Фрамужные ножницы", 728862, 2, "Ручка ROTOLINE белая", 377477, 1, "Ножницы", 627259, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Подпятник", 212008, 1, "Петля на створке", 740811, 2, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          fill2("-", "-", "-", "-", "-", "-");
                        } else {
                          fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        }
                      }
                    } else {
                      if (p4 < 1600) {
                        console.log('RotoAl фрам белый  ширина 1100-1600мм');
                        if (p5 < 500) {
                          fill("Минимальная высота - 500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Фрамужные ножницы", 728862, 2, "Ручка ROTOLINE белая", 377477, 1, "Ножницы", 627259, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Подпятник", 212008, 1, "Петля на створке", 740811, 2, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Доп. прижим на раме", 728885, 1, "Доп. прижим на створке", 728884, 1, "-", "-", "-");
                            fill2("-", "-", "-", "-", "-", "-");
                          } else {
                            fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          }
                        }
                      } else {
                        fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      }
                    }
                  }
                  break;
                case "Неокрас":
                  console.log('Roto Designio Фрамужное Неокрас');
                  if (p4 < 520) {
                    fill("Минимальная ширина - 520мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p4 < 1100) {
                      console.log('RotoAl фрам белый  ширина 500-1100мм ');
                      if (p5 < 500) {
                        fill("Минимальная высота - 500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Фрамужные ножницы", 728862, 2, "Ручка ROTOLINE неокрас", 238680, 1, "Ножницы", 627259, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Подпятник", 212008, 1, "Петля на створке", 740811, 2, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          fill2("-", "-", "-", "-", "-", "-");
                        } else {
                          fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        }
                      }
                    } else {
                      if (p4 < 1600) {
                        console.log('RotoAl фрам белый  ширина 1100-1600мм');
                        if (p5 < 500) {
                          fill("Минимальная высота - 500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Фрамужные ножницы", 728862, 2, "Ручка ROTOLINE неокрас", 238680, 1, "Ножницы", 627259, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Подпятник", 212008, 1, "Петля на створке", 740811, 2, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Доп. прижим на раме", 728885, 1, "Доп. прижим на створке", 728884, 1, "-", "-", "-");
                            fill2("-", "-", "-", "-", "-", "-");
                          } else {
                            fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          }
                        }
                      } else {
                        fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      }
                    }
                  }
                  break;
                case "Серый":
                  console.log('Roto Designio Фрамужное Серый');
                  if (p4 < 520) {
                    fill("Минимальная ширина - 520мм !!!", "", "", "", "", "", " ", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                  } else {
                    if (p4 < 1100) {
                      console.log('RotoAl фрам белый  ширина 500-1100мм ');
                      if (p5 < 500) {
                        fill("Минимальная высота - 500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      } else {
                        if (p5 < 1300) {
                          fill("Фрамужные ножницы", 728862, 2, "Ручка ROTOLINE серая", 377474, 1, "Ножницы", 627259, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Подпятник", 212008, 1, "Петля на створке", 740811, 2, "Ответная планка V01", 728918, 2, "Запорная цапфа", 334671, 2, "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          fill2("-", "-", "-", "-", "-", "-");
                        } else {
                          fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        }
                      }
                    } else {
                      if (p4 < 1600) {
                        console.log('RotoAl фрам белый  ширина 1100-1600мм');
                        if (p5 < 500) {
                          fill("Минимальная высота - 500мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                        } else {
                          if (p5 < 1300) {
                            fill("Фрамужные ножницы", 728862, 2, "Ручка ROTOLINE серая", 377474, 1, "Ножницы", 627259, 1, "Приёмник Т", 334754, 1, "Опора под ручку", 770712, 1, "Подпятник", 212008, 1, "Петля на створке", 740811, 2, "Ответная планка V01", 728918, 3, "Запорная цапфа", 334671, 3, "Доп. прижим на раме", 728885, 1, "Доп. прижим на створке", 728884, 1, "-", "-", "-");
                            fill2("-", "-", "-", "-", "-", "-");
                          } else {
                            fill("Максимальная высота - 1300мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                          }
                        }
                      } else {
                        fill("Максимальная ширина- 1600мм !!!", "", "", "", "", "", "", "", "", "", "", "", " ", "", "", "", "", "", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-", "-");
                      }
                    }
                  }
                  break;
                default:
                  console.log('Roto Designio Фрамужное Какой цвет ???');
              }
              break;
            default:
              console.log('Roto Designio Какое открывание ??? Какой цвет ???');
          }
          break;
      }
      break;
    case "Siegenia 2200":
      switch (p2) {
        case "Поворотно-откидное":
          switch (p3) {
            case "Белый":
              console.log('Siegenia 2200 Поворотно-откидное Белый');
              break;
            case "Неокрас":
              console.log('Siegenia 2200 Поворотно-откидное Неокрас');
              break;
            case "Серый":
              console.log('Siegenia 2200 Поворотно-откидное Серый');
              break;
            default:
              console.log('Siegenia 2200 Поворотно-откидное Какой цвет ???');
          }
          break;
        case "Поворотное":
          switch (p3) {
            case "Белый":
              console.log('Siegenia 2200 Поворотное Белый');
              break;
            case "Неокрас":
              console.log('Siegenia 2200 Поворотное Неокрас');
              break;
            case "Серый":
              console.log('Siegenia 2200 Поворотное Серый');
              break;
            default:
              console.log('Siegenia 2200 Поворотное Какой цвет ???');
          }
          break;
        case "Фрамужное":
          switch (p3) {
            case "Белый":
              console.log('Siegenia 2200 Фрамужное Белый');
              break;
            case "Неокрас":
              console.log('Siegenia 2200 Фрамужное Неокрас');
              break;
            case "Серый":
              console.log('Siegenia 2200 Фрамужное Серый');
              break;
            default:
              console.log('Siegenia 2200 Фрамужное Какой цвет ???');
          }
          break;
        default:
          console.log('Siegenia 2200 Какое открывание ??? Какой цвет ???');
      }
      break;
    case "Siegenia 5200":
      switch (p2) {
        case "Поворотно-откидное":
          switch (p3) {
            case "Белый":
              console.log('Siegenia 5200 Поворотно-откидное Белый');
              break;
            case "Неокрас":
              console.log('Siegenia 5200 Поворотно-откидное Неокрас');
              break;
            case "Серый":
              console.log('Siegenia 5200 Поворотно-откидное Серый');
              break;
            default:
              console.log('Siegenia 5200 Поворотно-откидное Какой цвет ???');
          }
          break;
        case "Поворотное":
          switch (p3) {
            case "Белый":
              console.log('Siegenia 5200 Поворотное Белый');
              break;
            case "Неокрас":
              console.log('Siegenia 5200 Поворотное Неокрас');
              break;
            case "Серый":
              console.log('Siegenia 5200 Поворотное Серый');
              break;
            default:
              console.log('Siegenia 5200 Поворотное Какой цвет ???');
          }
          break;
        case "Фрамужное":
          switch (p3) {
            case "Белый":
              console.log('Siegenia 5200 Фрамужное Белый');
              break;
            case "Неокрас":
              console.log('Siegenia 5200 Фрамужное Неокрас');
              break;
            case "Серый":
              console.log('Siegenia 5200 Фрамужное Серый');
              break;
            default:
              console.log('Siegenia 5200 Фрамужное Какой цвет ???');
          }
          break;
        default:
          console.log('Siegenia 5200 Какое открывание ??? Какой цвет ???');
      }
      break;
    case "Siegenia Axxent+":
      switch (p2) {
        case "Поворотно-откидное":
          switch (p3) {
            case "Белый":
              console.log('Siegenia Axxent+ Поворотно-откидное Белый');
              break;
            case "Неокрас":
              console.log('Siegenia Axxent+ Поворотно-откидное Неокрас');
              break;
            case "Серый":
              console.log('Siegenia Axxent+ Поворотно-откидное Серый');
              break;
            default:
              console.log('Siegenia Axxent+ Поворотно-откидное Какой цвет ???');
          }
          break;
        case "Поворотное":
          switch (p3) {
            case "Белый":
              console.log('Siegenia Axxent+ Поворотное Белый');
              break;
            case "Неокрас":
              console.log('Siegenia Axxent+ Поворотное Неокрас');
              break;
            case "Серый":
              console.log('Siegenia Axxent+ Поворотное Серый');
              break;
            default:
              console.log('Siegenia Axxent+ Поворотное Какой цвет ???');
          }
          break;
        case "Фрамужное":
          switch (p3) {
            case "Белый":
              console.log('Siegenia Axxent+ Фрамужное Белый');
              break;
            case "Неокрас":
              console.log('Siegenia Axxent+ Фрамужное Неокрас');
              break;
            case "Серый":
              console.log('Siegenia Axxent+ Фрамужное Серый');
              break;
            default:
              console.log('Siegenia Axxent+ Фрамужное Какой цвет ???');
          }
          break;
        default:
          console.log('Siegenia Axxent+ Какое открывание ??? Какой цвет ???');
      }
      break;
    default:
      console.log('Какая серия ??? Какое открывание ??? Какой цвет ???');
  }
}
function fill(p12, p13, p14, p22, p23, p24, p32, p33, p34, p42, p43, p44, p52, p53, p54, p62, p63, p64, p72, p73, p74, p82, p83, p84, p92, p93, p94, p102, p103, p104, p112, p113, p114, p122, p123, p124) {
  document.getElementById("tbl12").innerHTML = p12;
  document.getElementById("tbl13").innerHTML = p13;
  document.getElementById("tbl14").innerHTML = p14;
  document.getElementById("tbl22").innerHTML = p22;
  document.getElementById("tbl23").innerHTML = p23;
  document.getElementById("tbl24").innerHTML = p24;
  document.getElementById("tbl32").innerHTML = p32;
  document.getElementById("tbl33").innerHTML = p33;
  document.getElementById("tbl34").innerHTML = p34;
  document.getElementById("tbl42").innerHTML = p42;
  document.getElementById("tbl43").innerHTML = p43;
  document.getElementById("tbl44").innerHTML = p44;
  document.getElementById("tbl52").innerHTML = p52;
  document.getElementById("tbl53").innerHTML = p53;
  document.getElementById("tbl54").innerHTML = p54;
  document.getElementById("tbl62").innerHTML = p62;
  document.getElementById("tbl63").innerHTML = p63;
  document.getElementById("tbl64").innerHTML = p64;
  document.getElementById("tbl72").innerHTML = p72;
  document.getElementById("tbl73").innerHTML = p73;
  document.getElementById("tbl74").innerHTML = p74;
  document.getElementById("tbl82").innerHTML = p82;
  document.getElementById("tbl83").innerHTML = p83;
  document.getElementById("tbl84").innerHTML = p84;
  document.getElementById("tbl92").innerHTML = p92;
  document.getElementById("tbl93").innerHTML = p93;
  document.getElementById("tbl94").innerHTML = p94;
  document.getElementById("tbl102").innerHTML = p102;
  document.getElementById("tbl103").innerHTML = p103;
  document.getElementById("tbl104").innerHTML = p104;
  document.getElementById("tbl112").innerHTML = p112;
  document.getElementById("tbl113").innerHTML = p113;
  document.getElementById("tbl114").innerHTML = p114;
  document.getElementById("tbl122").innerHTML = p122;
  document.getElementById("tbl123").innerHTML = p123;
  document.getElementById("tbl124").innerHTML = p124;
}
function fill2(p132, p133, p134, p142, p143, p144) {
  document.getElementById("tbl132").innerHTML = p132;
  document.getElementById("tbl133").innerHTML = p133;
  document.getElementById("tbl134").innerHTML = p134;
  document.getElementById("tbl142").innerHTML = p142;
  document.getElementById("tbl143").innerHTML = p143;
  document.getElementById("tbl144").innerHTML = p144;
}
btn1.onclick = choise;
selects.forEach(function (select) {
  select.addEventListener('change', function (e) {
    document.getElementById("alarm").hidden = false;
    document.getElementById("alarm").innerHTML = "Данные для рассчёта изменились! Нажмите ПОДБОР";
  });
});
inputs.forEach(function (input) {
  input.addEventListener('input', function (e) {
    document.getElementById("alarm").hidden = false;
    document.getElementById("alarm").innerHTML = "Данные для рассчёта изменились! Нажмите ПОДБОР";
  });
});
},{}],"../node_modules/parcel-bundler/src/builtins/hmr-runtime.js":[function(require,module,exports) {
var global = arguments[3];
var OVERLAY_ID = '__parcel__error__overlay__';
var OldModule = module.bundle.Module;
function Module(moduleName) {
  OldModule.call(this, moduleName);
  this.hot = {
    data: module.bundle.hotData,
    _acceptCallbacks: [],
    _disposeCallbacks: [],
    accept: function (fn) {
      this._acceptCallbacks.push(fn || function () {});
    },
    dispose: function (fn) {
      this._disposeCallbacks.push(fn);
    }
  };
  module.bundle.hotData = null;
}
module.bundle.Module = Module;
var checkedAssets, assetsToAccept;
var parent = module.bundle.parent;
if ((!parent || !parent.isParcelRequire) && typeof WebSocket !== 'undefined') {
  var hostname = "" || location.hostname;
  var protocol = location.protocol === 'https:' ? 'wss' : 'ws';
  var ws = new WebSocket(protocol + '://' + hostname + ':' + "63740" + '/');
  ws.onmessage = function (event) {
    checkedAssets = {};
    assetsToAccept = [];
    var data = JSON.parse(event.data);
    if (data.type === 'update') {
      var handled = false;
      data.assets.forEach(function (asset) {
        if (!asset.isNew) {
          var didAccept = hmrAcceptCheck(global.parcelRequire, asset.id);
          if (didAccept) {
            handled = true;
          }
        }
      });

      // Enable HMR for CSS by default.
      handled = handled || data.assets.every(function (asset) {
        return asset.type === 'css' && asset.generated.js;
      });
      if (handled) {
        console.clear();
        data.assets.forEach(function (asset) {
          hmrApply(global.parcelRequire, asset);
        });
        assetsToAccept.forEach(function (v) {
          hmrAcceptRun(v[0], v[1]);
        });
      } else if (location.reload) {
        // `location` global exists in a web worker context but lacks `.reload()` function.
        location.reload();
      }
    }
    if (data.type === 'reload') {
      ws.close();
      ws.onclose = function () {
        location.reload();
      };
    }
    if (data.type === 'error-resolved') {
      console.log('[parcel] ✨ Error resolved');
      removeErrorOverlay();
    }
    if (data.type === 'error') {
      console.error('[parcel] 🚨  ' + data.error.message + '\n' + data.error.stack);
      removeErrorOverlay();
      var overlay = createErrorOverlay(data);
      document.body.appendChild(overlay);
    }
  };
}
function removeErrorOverlay() {
  var overlay = document.getElementById(OVERLAY_ID);
  if (overlay) {
    overlay.remove();
  }
}
function createErrorOverlay(data) {
  var overlay = document.createElement('div');
  overlay.id = OVERLAY_ID;

  // html encode message and stack trace
  var message = document.createElement('div');
  var stackTrace = document.createElement('pre');
  message.innerText = data.error.message;
  stackTrace.innerText = data.error.stack;
  overlay.innerHTML = '<div style="background: black; font-size: 16px; color: white; position: fixed; height: 100%; width: 100%; top: 0px; left: 0px; padding: 30px; opacity: 0.85; font-family: Menlo, Consolas, monospace; z-index: 9999;">' + '<span style="background: red; padding: 2px 4px; border-radius: 2px;">ERROR</span>' + '<span style="top: 2px; margin-left: 5px; position: relative;">🚨</span>' + '<div style="font-size: 18px; font-weight: bold; margin-top: 20px;">' + message.innerHTML + '</div>' + '<pre>' + stackTrace.innerHTML + '</pre>' + '</div>';
  return overlay;
}
function getParents(bundle, id) {
  var modules = bundle.modules;
  if (!modules) {
    return [];
  }
  var parents = [];
  var k, d, dep;
  for (k in modules) {
    for (d in modules[k][1]) {
      dep = modules[k][1][d];
      if (dep === id || Array.isArray(dep) && dep[dep.length - 1] === id) {
        parents.push(k);
      }
    }
  }
  if (bundle.parent) {
    parents = parents.concat(getParents(bundle.parent, id));
  }
  return parents;
}
function hmrApply(bundle, asset) {
  var modules = bundle.modules;
  if (!modules) {
    return;
  }
  if (modules[asset.id] || !bundle.parent) {
    var fn = new Function('require', 'module', 'exports', asset.generated.js);
    asset.isNew = !modules[asset.id];
    modules[asset.id] = [fn, asset.deps];
  } else if (bundle.parent) {
    hmrApply(bundle.parent, asset);
  }
}
function hmrAcceptCheck(bundle, id) {
  var modules = bundle.modules;
  if (!modules) {
    return;
  }
  if (!modules[id] && bundle.parent) {
    return hmrAcceptCheck(bundle.parent, id);
  }
  if (checkedAssets[id]) {
    return;
  }
  checkedAssets[id] = true;
  var cached = bundle.cache[id];
  assetsToAccept.push([bundle, id]);
  if (cached && cached.hot && cached.hot._acceptCallbacks.length) {
    return true;
  }
  return getParents(global.parcelRequire, id).some(function (id) {
    return hmrAcceptCheck(global.parcelRequire, id);
  });
}
function hmrAcceptRun(bundle, id) {
  var cached = bundle.cache[id];
  bundle.hotData = {};
  if (cached) {
    cached.hot.data = bundle.hotData;
  }
  if (cached && cached.hot && cached.hot._disposeCallbacks.length) {
    cached.hot._disposeCallbacks.forEach(function (cb) {
      cb(bundle.hotData);
    });
  }
  delete bundle.cache[id];
  bundle(id);
  cached = bundle.cache[id];
  if (cached && cached.hot && cached.hot._acceptCallbacks.length) {
    cached.hot._acceptCallbacks.forEach(function (cb) {
      cb();
    });
    return true;
  }
}
},{}]},{},["../node_modules/parcel-bundler/src/builtins/hmr-runtime.js","script.js"], null)
//# sourceMappingURL=/script.75da7f30.js.map